app/controllers/groups_controller.rb

def create
   @group = Group.new(group_params)
   @group.save
---
INSERT INTO "groups" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "w "], ["description", "zhen  chun"], ["created_at", "2017-08-01 04:13:31.733956"], ["updated_at", "2017-08-01 04:13:31.733956"]]

   def update
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]